[
  {
    "name": "SMAOffsetLongShort",
    "factor": 1.56,
    "id": "16",
    "desc": "The 'SMAOffsetLongShort' strategy is designed for leverage trading with both long and short positions, using a leverage factor of 5. It operates on a 5-minute timeframe and includes an additional 1-hour informative timeframe. The strategy combines Simple Moving Averages (SMA) with customizable offsets for entry and exit points and uses Exponential Moving Averages (EMA) to detect market trends. Long positions are entered when the price is below the offset SMA and in an uptrend, while short positions are entered when the price is above the offset SMA and in a downtrend. The strategy includes both fixed and custom stoploss mechanisms, optimizing entry and exit points to maximize profits in both rising and falling markets."
  },
  {
    "name": "SMAOffsetOptV1",
    "factor": 2.15,
    "id": "13",
    "desc": "This strategy combines the offset of Simple Moving Average (SMA) and Exponential Moving Average (EMA) to generate buy and sell signals, incorporating custom stop-loss and trailing stop mechanisms to capture short-term price fluctuations, making it suitable for high-frequency trading. Buy and sell signals are based on the crossing of price with offset moving averages, while parameters such as the length of the moving averages, offset values, and triggers can be flexibly adjusted to adapt to different market conditions. The strategy includes detailed take-profit and stop-loss rules, like a gradually decreasing minimum return on investment (ROI) and flexible trailing stops, designed to prevent drawdowns and lock in profits. However, its actual effectiveness depends on the market environment, requiring comprehensive backtesting and optimization using historical data to ensure stability and profitability. In live trading, continuous monitoring and adjustments based on market dynamics are necessary to enhance the strategy's effectiveness and adaptability."
  },
  {
    "name": "TheRealPullbackV2",
    "factor": 1.29,
    "id": "14",
    "desc": "The 'TheRealPullbackV2' strategy aims to capture rebound opportunities after price pullbacks by combining multiple technical indicators, including Bollinger Bands, RSI, DMI, CCI, MFI, CMF, RMI, and Stochastic RSI. Operating on a 5-minute timeframe, the strategy identifies 'dip' signals in oversold regions and breakout signals using Bollinger Bands to decide on trade entries, with a fixed stop-loss of -3.5%. Buy signals are confirmed through a combination of oversold conditions, while sell signals are triggered when the price reaches the middle or upper Bollinger Bands. This approach is designed to identify potential price reversal points in strong trending markets, aiming to profit from rebounds after pullbacks. The strategy's strength lies in its strict signal generation, filtering out false signals, but its complexity necessitates thorough backtesting and optimization. Due to its 5-minute timeframe, it is better suited for high-frequency trading environments."
  }
]